tests/load/production_simulation.yml
config:
  target: "{{ $processEnvironment.API_URL || 'http://localhost:3333' }}"
  phases:
    # Fase 1: 100 usuarios concurrentes (calentamiento 2 min)
    - name: "100_users_warmup"
      duration: 120
      arrivalRate: 1
      rampTo: 10
      name: "Warmup - 100 concurrent users"

    # Fase 2: 500 usuarios concurrentes (carga media 3 min)
    - name: "500_users_load"
      duration: 180
      arrivalRate: 10
      rampTo: 30
      name: "Medium load - 500 concurrent users"

    # Fase 3: 1000 usuarios concurrentes (pico 2 min)
    - name: "1000_users_peak"
      duration: 120
      arrivalRate: 30
      rampTo: 60
      name: "Peak load - 1000 concurrent users"

    # Fase 4: recuperación (1 min)
    - name: "recovery"
      duration: 60
      arrivalRate: 5
      name: "Recovery phase"

  # Configuración de Socket.IO
  plugins:
    metrics-by-endpoint:
      use: artillery-plugin-metrics-by-endpoint
    publish-metrics:
      - type: console

  variables:
    clienteEmail: "cliente_{{ $randomNumber(1,1000) }}@test.com"
    conductorEmail: "conductor_{{ $randomNumber(1,500) }}@test.com"
    password: "password123"

scenarios:
  # ── Escenario 1: Login cliente ──────────────────────────────────
  - name: "Cliente login y crea viaje"
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ clienteEmail }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "clienteToken"
      - think: 1
      - post:
          url: "/api/trips/request"
          headers:
            authorization: "Bearer {{ clienteToken }}"
          json:
            origenLat: "{{ $randomNumber(10,11) }}.{{ $randomNumber(100000,999999) }}"
            origenLng: "{{ $randomNumber(-75,-74) }}.{{ $randomNumber(100000,999999) }}"
            destinoLat: "{{ $randomNumber(10,11) }}.{{ $randomNumber(100000,999999) }}"
            destinoLng: "{{ $randomNumber(-75,-74) }}.{{ $randomNumber(100000,999999) }}"
            direccionOrigen: "Calle {{ $randomNumber(1,100) }} #{{ $randomNumber(1,50) }}-{{ $randomNumber(1,99) }}"
            direccionDestino: "Carrera {{ $randomNumber(1,100) }} #{{ $randomNumber(1,50) }}-{{ $randomNumber(1,99) }}"
          capture:
            - json: "$.viaje.id"
              as: "tripId"

  # ── Escenario 2: Login conductor y acepta viaje ────────────────
  - name: "Conductor login, location updates y acepta viaje"
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ conductorEmail }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "conductorToken"
      - think: 1
      # GPS updates cada ~5 segundos durante la prueba
      - loop:
          - put:
              url: "/api/drivers/location"
              headers:
                authorization: "Bearer {{ conductorToken }}"
              json:
                lat: "{{ $randomNumber(10,11) }}.{{ $randomNumber(100000,999999) }}"
                lng: "{{ $randomNumber(-75,-74) }}.{{ $randomNumber(100000,999999) }}"
          - think: 5
        count: 5

  # ── Escenario 3: Chat en tiempo real ────────────────────────────
  - name: "Chat messages"
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ clienteEmail }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "chatToken"
      - post:
          url: "/api/trips/request"
          headers:
            authorization: "Bearer {{ chatToken }}"
          json:
            origenLat: "10.987654"
            origenLng: "-74.123456"
            destinoLat: "10.123456"
            destinoLng: "-74.654321"
            direccionOrigen: "Carrera 5 #10-20"
            direccionDestino: "Calle 80 #30-40"
          capture:
            - json: "$.viaje.id"
              as: "tripIdChat"
      - loop:
          - post:
              url: "/api/trips/{{ tripIdChat }}/chat"
              headers:
                authorization: "Bearer {{ chatToken }}"
              json:
                mensaje: "Hola, voy en camino {{ $randomNumber(1,100) }}"
          - think: 10
        count: 3

  # ── Escenario 4: Viaje completo (request → complete) ────────────
  - name: "Full trip lifecycle"
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ clienteEmail }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "fullToken"
      - post:
          url: "/api/trips/request"
          headers:
            authorization: "Bearer {{ fullToken }}"
          json:
            origenLat: "10.987654"
            origenLng: "-74.123456"
            destinoLat: "10.123456"
            destinoLng: "-74.654321"
            direccionOrigen: "Calle 10 #5-30"
            direccionDestino: "Carrera 20 #15-50"
          capture:
            - json: "$.viaje.id"
              as: "fullTripId"

  # ── Escenario 5: Conductor solo GPS (sin login cada vez) ──────
  - name: "Conductor steady GPS stream"
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ conductorEmail }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "gpsToken"
      - loop:
          - put:
              url: "/api/drivers/location"
              headers:
                authorization: "Bearer {{ gpsToken }}"
              json:
                lat: "{{ $randomNumber(10,11) }}.{{ $randomNumber(100000,999999) }}"
                lng: "{{ $randomNumber(-75,-74) }}.{{ $randomNumber(100000,999999) }}"
          - think: 5
        count: 20